Revit 2024 API
DividedSurface.GetGridNodeLocation Method
Specify whether a particular grid node is interior to the surface, on the boundary, or outside the boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public GridNodeLocation GetGridNodeLocation(
	GridNode gridNode
)
Visual Basic
Public Function GetGridNodeLocation ( _
	gridNode As GridNode _
) As GridNodeLocation
Visual C++
public:
GridNodeLocation GetGridNodeLocation(
	GridNode gridNode
)
Parameters
gridNode
Type: Autodesk.Revit.DB.GridNode
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
DividedSurface Class
Autodesk.Revit.DB Namespace